############################################
# 0914 : DAY01 : TEST
############################################

"""
Q.01 동적 타이핑과 정적 타이핑에 대해 설명하세요

"""
"""
Q.02 

영문 소문자 'q'가 입력될 때까지
입력한 문자를 계속 출력하는 프로그램을 작성하세요

""" 
"""
Q.03 
점수 구간에 해당하는 학점이 아래와 같이 정의되어 있다
사용자로부터 score를 입력받아 학점을 출력하세요


점수	학점
81~100	A
61~80	B
41~60	C
21~40	D
0~20	E

"""
"""
Q.04 
사용자로부터 세 개의 숫자를 입력 받은 후 
가장 큰 숫자를 출력하세요

"""
"""
Q.05
주민등록번호 뒷 자리 7자리 중 첫째 자리는 성별을 나타내는데, 
1, 3은 남자 2, 4는 여자를 의미한다. 
사용자로부터 13자리의 주민등록번호를 입력 받은 후 
성별 (남자, 여자)를 출력하는 프로그램을 작성하세요

"""
"""
Q.06
사용자로부터 문자 한 개를 입력 받고, 
소문자일 경우 대문자로, 
대문자 일 경우, 소문자로 변경해서 출력하세요

"""
#####################################################
"""
Q.06
아래의 표에서, 아이스크림 이름을 키값으로, 
(가격, 재고) 리스트를 딕셔너리의 값으로 저장하세요.
딕셔너리의 이름은 icecream로 한다.

이름	    가격	재고
----------------------------
메로나	    300	    20
비비빅	    400	    3
죠스바	    250	    100

"""
"""
Q.07
icecream 딕셔너리에서 메로나의 재고를 출력하세요

"""
"""
Q.08
icecream 딕셔너리에서 비비빅의 가격을 출력하세요

"""
#####################################################
"""
Q.09
월드컵은 4년에 한 번 개최된다. 
2002~2050년까지 중 월드컵이 개최되는 연도를 출력하세요

-9.1 range() 안쓰고 
-9.2 range() 쓰고

"""
"""
Q.10
4*4 마방진 만들기

마방진이란 N*N 크기의 정사각형 격자에 1부터 N^2까지의 숫자를 
중복 없이 채워 넣었을 때, 가로, 세로, 두 대각선에 있는 
숫자들의 합이 모두 같아지도록 배열한 것.

1부터 16까지의 숫자가 사용되며, 
가로·세로·대각선의 모든 합은 34.

"""



